# 디자인 패턴?
프로그램이나 특정한 것을 개발할 때, 특정한 규약에 따라 사용하는 패턴

# 디자인 패턴을 사용해야 되는 상황?
디자인 패턴은 소프트웨어 설계 문제를 해결하기 위해 사용한다.

1. 재사용 가능성

재사용 가능한 솔루션을 제공하기 때문에 개발 시간을 절약할 수 있다.

2. 추상화

특정 구현의 세부사항을 추상화하는 데 도움이 되므로 소프트웨어 설계의 큰 그림에 집중할 수 있다.

> 추상화?
복잡한 자료, 모듈, 시스템 등으로부터 핵심적인 개념 또는 기능을 간추려 내는 것
    

3. 유지보수

모듈화해서 유지 관리 가능한 방식으로 설계할 수 있게 돼서 향후 변경 및 업테이트가 쉬워진다.

# 느슨한 결합?
느슨한 결합은 소프트웨어 시스템에서 구성 요소의 디커플링을 촉진하는 설계 원리를 가리킨다. 

디자인 패턴은 결합을 줄이고 모듈성을 증가시키는 방식으로 코드를 구조화하는 방법에 대한 지침을 제공한다. 
디자인 패턴은 소프트웨어 구성요소 간의 느슨한 관계를 촉진함으로써 소프트웨어 시스템을 보다 유연하고, 유지관리 가능하며, 확장 가능하게 만들 수 있다.

> 디커플링
인터페이스를 이용해 모듈 사이의 의존성을 감소하고 유지보수 효과를 높이는 방법


